"""
File: dev.py
Author: Dmitry Ryumin and Alexandr Axyonov
Description: Constants for the development mode.
License: MIT License
"""

from typing import Optional, Tuple


class Dev:
    VACANCY_SKILLS: str = "Навык"
    SUBJECT_SKILLS: str = VACANCY_SKILLS
    GROUPED_ITEMS: dict[str, list[Tuple[list[Optional[str]], str, str]]] = {
        "Бакалавриат": [
            (
                [
                    "1111111111",
                    "Python",
                    "CS=0.1",
                    "Москва",
                    "факультет компьютерных наук",
                    "департамент больших данных и информационного поиска",
                    "Бакалавриат",
                    "3 модуль 2022/2023 - 4 модуль 2022/2023",
                    "для своего кампуса",
                    "с онлайн-курсом",
                    "1",
                    6.51,
                    0.32,
                    "-",
                    "-",
                    "-",
                    "-",
                    "-",
                    "-",
                    "-",
                    "-",
                ],
                "Уровень обучения:",
                "Бакалавриат",
            ),
            (
                [
                    "1111111111",
                    "C++",
                    "CS=0.2",
                    "Москва",
                    "факультет социальных наук",
                    "базовая кафедра компании 'ЭКОПСИ Консалтинг'",
                    "Бакалавриат",
                    "4 модуль 2022/2023 - 4 модуль 2022/2023",
                    "для своего кампуса",
                    "без онлайн-курса",
                    "3",
                    7.25,
                    0.55,
                    "-",
                    "-",
                    "-",
                    "-",
                    "-",
                    "-",
                    "-",
                    "-",
                ],
                "Уровень обучения:",
                "Бакалавриат",
            ),
        ],
        "Бакалавриат, Специалитет": [
            (
                [
                    "2222222222",
                    "PHP",
                    "CS=0.3",
                    "Москва",
                    "факультет компьютерных наук",
                    "отдел развития цифровых компетенций",
                    "Бакалавриат, Специалитет",
                    "4 модуль 2024/2025 - 4 модуль 2024/2025",
                    "для всех кампусов НИУ ВШЭ",
                    "с онлайн-курсом",
                    "-",
                    None,
                    None,
                    "-",
                    "-",
                    "-",
                    "-",
                    "-",
                    "-",
                    "-",
                    "-",
                ],
                "Уровень обучения:",
                "Бакалавриат, Специалитет",
            )
        ],
        "Магистратура": [
            (
                [
                    "3333333333",
                    "JS",
                    "CS=0.4",
                    "НИУ ВШЭ - Санкт-Петербург",
                    "Факультет Санкт-Петербургская школа экономики и менеджмента",
                    "департамент менеджмента",
                    "Магистратура",
                    "2 модуль 2023/2024 - 2 модуль 2023/2024",
                    "для своего кампуса",
                    "без онлайн-курса",
                    "2",
                    7.17,
                    0.54,
                    "-",
                    "-",
                    "-",
                    "-",
                    "-",
                    "-",
                    "-",
                    "-",
                ],
                "Уровень обучения:",
                "Магистратура",
            )
        ],
    }
    ITEMS_SORTED: str = (
        "Вакансия 1 | CS=0.5530 | Навык 1, Навык 2, Навык 3;"
        "Вакансия 2 | CS=0.5375 | Навык 1, Навык 2;"
        "Вакансия 3 | CS=0.5343 | Навык 1, Навык 2;"
        "Вакансия 4 | CS=0.5276 | Навык 1, Навык 2, Навык 3;"
        "Вакансия 5 | CS=0.5236 | None;"
        "Вакансия 6 | CS=0.5044 | Навык 1, Навык 2;"
        "Вакансия 7 | CS=0.5034 | None;"
        "Вакансия 8 | CS=0.4976 | Навык 1"
    )
